{
    "blank_dialogue": [
        ""
    ],

    "demo_end": [
        "Thank you for playing this demo!",
        "We know it's just a buggy taste...",
        "next time we will do even better, we promise!"
    ],


    "object_collected": [
        "Object collected!"
    ],

    "dungeon_keeper": [
        "Not many dare to reach this place...",
        "The shadows here do not forgive the curious.",
        "Yet I see your heart does not falter.",
        "Hear this: what lies within is not meant for all.",
        "Are you ready? Then let the gate open for you..."
    ],

    "hooded_man": [
        "Heh… so you seek passage, do you?",
        "I too need a key… but it is not whole.",
        "Bring me both halves, and I might let you step forward first.",
        "Fail… or betray me, and the shadows will enjoy your company.",
        "Do you understand? Two pieces, one task, one reward.",
        "Enough talk. Now go!"
    ],

    "death_messages": [
        "Well... not everyone gets to be the main character.",
        "Game Over? Yeah, I've heard of it.",
        "Press Retry and we'll both pretend this never happened.",
        "Don't worry, it was just the tutorial...no it isn't.",
        "Statistically, this was bound to happen.",
        "Interesting strategy. Horrible results.", 
        "It's over. But hey, at least you looked cool dying.",
        "Retry? Or just... go outside maybe?",
        "A brave effort. A stupid one, but brave."
        ],

        "sword_player": [
        "You raise the blade and strike with ferocity.",
        "You slash through the air, tearing the silence apart.",
        "Your blow resounds like an oath of blood.",
        "You hurl your sword, and even the wind bends to your wrath."
    ],

    "shield_player": [
        "You lift your shield, the metal humming with power.",
        "You take cover behind your defense, awaiting fate.",
        "The impact thunders, yet you stand firm as stone.",
        "You defend yourself, and the world seems to slow around you."
    ],

    "magic_player": [
        "You summon the abyss: a vortex of dark light bursts from your hands.",
        "Your voice whispers a spell long forgotten by the gods.",
        "You unleash a power that tears through reality itself.",
        "An arcane bolt strikes down with divine fury."
    ],

    "sword_enemy": [
        "The enemy swings a sharp blow, the blade screaming for blood.",
        "A trail of steel flashes in the dark — the strike is lightning-fast.",
        "Their slash grazes you, leaving behind the echo of death."
    ],

    "shield_enemy": [
        "The enemy raises their shield, gaze cold and impenetrable.",
        "They watch you, still as a statue of iron and will.",
        "Their defense is absolute — as if the world itself could not harm them."
    ],

    "magic_enemy": [
        "The air distorts — the enemy enchants reality itself.",
        "A wicked glow dances in their hands: forbidden magic.",
        "You feel a dark power wrapping around the battlefield."
    ],

    "draw": [
        "Both move in unison, reflections in the mirror of war.",
        "The forces cancel each other — fate remains suspended.",
        "The clash fades away: no one prevails."
    ],

    "victory_player": [
        "You triumph. Blood and glory are yours.",
        "The enemy falls, and your breath mingles with victory.",
        "You have won — yet something inside you feels broken."
    ],

    "victory_enemy": [
        "You fall to the ground, and the world turns red and silent.",
        "The enemy smiles — defeat chills your heart.",
        "You have lost, but your spirit will not forget this wound."
    ]
}
